In [5]:
import pandas as pd

data = {
    "Name": ["Alice", "Bob", "Charlie", "Alice", "x", "Frank", "Grace", "Hannah","Sakib"],
    "City": ["New York", "Los Angeles", "Newark", "New York", "New Delhi", "Chicago", "New Orleans", "Houston","H Los Ang"],
    "Department": ["HR", "IT", "Finance", "HR", "x", "Marketing", "Finance", "HR", "HR"],
    "Salary": [50000, 60000, 55000, 50000, 50000, 58000, 62000, 51000,70000]
}

df = pd.DataFrame(data)
df

      Name         City Department  Salary
0    Alice     New York         HR   50000
1      Bob  Los Angeles         IT   60000
2  Charlie       Newark    Finance   55000
3    Alice     New York         HR   50000
4        x    New Delhi          x   50000
5    Frank      Chicago  Marketing   58000
6    Grace  New Orleans    Finance   62000
7   Hannah      Houston         HR   51000
8    Sakib    H Los Ang         HR   70000

In [7]:
df.duplicated().sum()

np.int64(1)

In [10]:
# deleting duplicates values

df.drop_duplicates()  # deletes the duplivated one
df

      Name         City Department  Salary
0    Alice     New York         HR   50000
1      Bob  Los Angeles         IT   60000
2  Charlie       Newark    Finance   55000
3    Alice     New York         HR   50000
4        x    New Delhi          x   50000
5    Frank      Chicago  Marketing   58000
6    Grace  New Orleans    Finance   62000
7   Hannah      Houston         HR   51000
8    Sakib    H Los Ang         HR   70000

In [11]:
df.drop_duplicates(inplace = True)  # deletes the duplivated one
df

      Name         City Department  Salary
0    Alice     New York         HR   50000
1      Bob  Los Angeles         IT   60000
2  Charlie       Newark    Finance   55000
4        x    New Delhi          x   50000
5    Frank      Chicago  Marketing   58000
6    Grace  New Orleans    Finance   62000
7   Hannah      Houston         HR   51000
8    Sakib    H Los Ang         HR   70000

In [12]:
df

      Name         City Department  Salary
0    Alice     New York         HR   50000
1      Bob  Los Angeles         IT   60000
2  Charlie       Newark    Finance   55000
4        x    New Delhi          x   50000
5    Frank      Chicago  Marketing   58000
6    Grace  New Orleans    Finance   62000
7   Hannah      Houston         HR   51000
8    Sakib    H Los Ang         HR   70000

# deleting column wise

In [21]:
df.drop_duplicates(subset=['Salary'], keep='last')
# in case of keep='last' means it would delete the first one

      Name         City Department  Salary
1      Bob  Los Angeles         IT   60000
2  Charlie       Newark    Finance   55000
4        x    New Delhi          x   50000
5    Frank      Chicago  Marketing   58000
6    Grace  New Orleans    Finance   62000
7   Hannah      Houston         HR   51000
8    Sakib    H Los Ang         HR   70000